import asyncio
import random

MALATH = [
    """
«قال رسول الله صلى الله عليه وسلم: أنا أغنى الشركاء عن الشرك ، من عمل عملا أشرك فيه معي غيري تركته وشركه. رواه مسلم ، وفي رواية ابن ماجه : ( فأنا منه بريء وهو للذي أشرك ).
""",
    """
(عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ 
وعنه أيضاً أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ 
 وأخيراً عنه أيضاً قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم : مَنْ يَقُمْ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ
 ٍ ")❤️🌸┊𖤐𓈒𓏲
""",
    """
‏{«قال رسول الله صلى الله عليه وسلم: كَلِمَتانِ حَبِيبَتانِ إلى الرَّحْمَنِ، خَفِيفَتانِ علَى اللِّسانِ، ثَقِيلَتانِ في المِيزانِ: سُبْحانَ اللَّهِ وبِحَمْدِهِ، سُبْحانَ اللَّهِ العَظِيمِ.ُ»
""",
    """
(قال رسول الله صلى الله عليه وسلم: رَغِمَ أنْفُهُ، ثُمَّ رَغِمَ أنْفُهُ، ثُمَّ رَغِمَ أنْفُهُ قيلَ: مَنْ؟ يا رَسولَ اللهِ، قالَ: مَن أدْرَكَ والِدَيْهِ عِنْدَ الكِبَرِ، أحَدَهُما، أوْ كِلَيْهِما، ثُمَّ لَمْ يَدْخُلِ الجَنَّةَ.). ❤️🌸┊𖤐𓈒𓏲
""",
    """
‏عن الحاكم من حديث ابن عباس رضي الله تعالى عنهما عن النبي صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أنه قال: يا أيها الناس؛ إني قد تركت فيكم ما إن اعتصمتم به فلن تضلوا أبداً، كتاب الله، وسنة نبيه.ْ﴾❤️🌸┊𖤐𓈒𓏲
""",
    """
{قال رسول الله صلى الله عليه وسلم: مَن نَفَّسَ عن مُؤْمِنٍ كُرْبَةً مِن كُرَبِ الدُّنْيَا، نَفَّسَ اللَّهُ عنْه كُرْبَةً مِن كُرَبِ يَومِ القِيَامَةِ، وَمَن يَسَّرَ علَى مُعْسِرٍ، يَسَّرَ اللَّهُ عليه في الدُّنْيَا وَالآخِرَةِ، وَمَن سَتَرَ مُسْلِمًا، سَتَرَهُ اللَّهُ في الدُّنْيَا وَالآخِرَةِ، وَاللَّهُ في عَوْنِ العَبْدِ ما كانَ العَبْدُ في عَوْنِ أَخِيهِ، وَمَن سَلَكَ طَرِيقًا يَلْتَمِسُ فيه عِلْمًا، سَهَّلَ اللَّهُ له به طَرِيقًا إلى الجَنَّةِ، وَما اجْتَمع قَوْمٌ في بَيْتٍ مِن بُيُوتِ اللهِ، يَتْلُونَ كِتَابَ اللهِ، وَيَتَدَارَسُونَهُ بيْنَهُمْ، إِلَّا نَزَلَتْ عليهمِ السَّكِينَةُ، وَغَشِيَتْهُمُ الرَّحْمَةُ وَحَفَّتْهُمُ المَلَائِكَةُ، وَذَكَرَهُمُ اللَّهُ فِيمَن عِنْدَهُ، وَمَن بَطَّأَ به عَمَلُهُ، لَمْ يُسْرِعْ به نَسَبُهُ. غيرَ أنَّ حَدِيثَ أَبِي أُسَامَةَ ليسَ فيه ذِكْرُ التَّيْسِيرِ علَى المُعْسِرِ.
 ) ❤️🌸┊𖤐𓈒𓏲 .
""",
    """
(قال رسول الله صلى الله عليه وسلم: مَثَلُ الْمُؤْمِنِ الَّذِي يَقْرَأُ الْقُرْآنَ كَمَثَلِ الأُتْرُجَّةِ؛ رِيحُهَا طَيِّبٌ وَطَعْمُهَا طَيِّبٌ, وَمَثَلُ الْمُؤْمِنِ الَّذِي لَا يَقْرَأُ الْقُرْآنَ؛ كَمَثَلِ التَّمْرَةِ لَا رِيحَ لَهَا وَطَعْمُهَا حُلْوٌ, وَمَثَلُ الْمُنَافِقِ الَّذِي يَقْرَأُ الْقُرْآنَ مَثَلُ الرَّيْحَانَةِ؛ رِيحُهَا طَيِّبٌ وَطَعْمُهَا مُرٌّ, وَمَثَلُ الْمُنَافِقِ الَّذِي لَا يَقْرَأُ الْقُرْآنَ كَمَثَلِ الْحَنْظَلَةِ لَيْسَ لَهَا رِيحٌ وَطَعْمُهَا مُرٌّ.)❤️🌸┊𖤐𓈒𓏲
""",
    """
﴿ قال رسول الله صلى الله عليه وسلم: لا حَسَدَ إلَّا في اثْنَتَيْنِ: رَجُلٌ عَلَّمَهُ اللَّهُ القُرْآنَ، فَهو يَتْلُوهُ آناءَ اللَّيْلِ، وآناءَ النَّهارِ، فَسَمِعَهُ جارٌ له، فقالَ: لَيْتَنِي أُوتِيتُ مِثْلَ ما أُوتِيَ فُلانٌ، فَعَمِلْتُ مِثْلَ ما يَعْمَلُ، ورَجُلٌ آتاهُ اللَّهُ مالًا فَهو يُهْلِكُهُ في الحَقِّ، فقالَ رَجُلٌ: لَيْتَنِي أُوتِيتُ مِثْلَ ما أُوتِيَ فُلانٌ، فَعَمِلْتُ مِثْلَ ما يَعْمَلُ.
  ﴾❤️🌸┊𖤐𓈒𓏲
""",
    """: عن ابن مسعود رضي الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقول (نضر الله امرأ سمع منا شيئا فبلغه كما سمعه فرب مبلغ أوعى من سامع) أخرجه البخاري 
 .❤️🌸┊𖤐𓈒𓏲
""",
    """
 عن أبي الدرداء رضي الله عنه قال سمعت رسول الله صلى الله عليه يقول(من سلك طريقا يبتغي فيه علما سهل الله له طريقا إلى الجنة وان الملائكة لتضع أجنحتها لطالب العلم رضى بما يصنع وان العالم ليستغفر له من في السماوات ومن في الأرض حتى الحيتان في الماء وفضل العالم على العابد كفضل القمر على سائر الكواكب وان العلماء ورثة الأنبياء وان الأنبياء لم يورثوا دينارا ولا درهما وإنما ورثوا العلم فمن أخذه اخذ بحظ وافر) أخرجه مسلم__   الحديث الخامس عشر: عن عبد الله بن عمرو بن العاص رضي الله عنهما قال سمعت رسول الله صلى الله عليه يقول( إن الله لا يقبض العلم انتزاعا ينتزعه من الناس ولكن يقبض العلم بقبض العلماء حتى إذا لم يبق عالما اتخذ الناس رؤوسا جهالا فسئلوا فأفتوا بغير علم فضلوا وأضلوا) أخرجه البخاري ❤️🌸┊𖤐𓈒𓏲
""",
    """
{   عن أبي امامة رضي الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقول( فضل العالم على العابد كفضلي على أدناكم) ثم قال صلى الله عليه وسلم ( إن الله وملائكته وأهل السماوات والأرض حتى النملة في جحرها وحتى الحوت ليصلون على معلمي الناس الخير)أخرجه أبو داود الحديث الحادي عشر: عن ابن مسعود رضي الله عنه قال قال صلى الله عليه وسلم( لا حسد إلا في اثنتين رجل آتاه الله مالا فسلطه على هلكته في الحق ورجل آتاه الله الحكمة فهو يقضي بها ويعلمها) أخرجه البخاري 
} .❤️🌸┊𖤐𓈒𓏲
""",
    """
‏﴿   عن انس بن مالك رضي الله عنه قال قال صلى الله عليه وسلم( من خرج في طلب العلم كان في سبيل الله حتى يرجع)__   الحديث الثالث عشر: عن أبي هريرة رضي الله عنه قال قال صلى الله عليه وسلم(من دعا إلى هدى كان له من الأجر مثل أجور من تبعه لا ينقص ذلك من أجورهم شيئا) أخرجه مسلم 
َ ﴾.❤️🌸┊𖤐𓈒𓏲
""",
    """
 عن عبد الله بن عمرو بن العاص رضي الله عنهما أن النبي صلى الله عليه وسلم قال( بلغوا عني ولو ايه وحدثوا عن بني إسرائيل ولا حرج ومن كذب علي متعمدا فليتبواء مقعده من النار) أخرجه البخاري__   الحديث التاسع: عن أبي هريرة رضي الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقول (الدنيا ملعونة ملعون مافيها إلا ذكر الله تعالى وما والاه وعالما أو متعلما)أخرجه الترمذي 
❤️🌸┊𖤐𓈒𓏲
""",
    """
عن أنس بن مالك -رضي الله عنه- أن رسول الله -عليه الصَّلاة والسَّلام- قال: \"مَنْ سَقَى الماءَ في موضعٍ قُدِرَ على الماءِ فله بكلِّ شربةٍ يشربُها برًّا كان أو فاجرًا عشرُ حسناتٍ تُكتب له وعشرُ درجاتٍ تُرفعُ لهُ وعشرُ سيئاتٍ تُحطُّ عنه، وإن شربهُ العَطشانُ فعِتقُ نَسَمةً، فإن شَرِبَهُ العطشانُ الذي قد هجم على الموتِ فعِتقُ ستينَ نسمةً، ومن سقى الماءَ في موضعٍ لا يُقْدَرُ على الماءِ فكأنما أحيا الناسَ جميعًا، قلتُ له: وما أحيا الناسَ جميعًا، قال: أليس إذا أحييتَ نفسًا فثوابُك الجنةُ، وكذا مَنْ أحيا الناسَ جميعًا فثوابهُ الجنةُ\" . __ روى عبد الله بن عمر -رضي الله عنهما- قال: \"سَمِعْتُ رسولَ اللهِ -صلى الله عليه وسلم- وهو يُسْأَلُ عن الماءِ يكونُ في الفَلاةِ مِن الأرضِ، وما يَنُوبُه مِن السِّبَاعِ والدَّوَابِ؟ فقال: إذا كان الماءُ قُلَّتَيْنِ لم يَحْمِلِ الخَبَثَ\" . __ روى عبد الله بن عمرو -رضي الله عنه-: \"أنَّ النَّبيَّ -صلَّى اللَّهُ عليهِ وسلَّمَ- مرَّ بسَعدٍ وَهوَ يتوضَّأُ، فقالَ: ما هذا السَّرَفُ يا سَعدُ؟ قالَ: أفي الوضوءِ سَرفٌ، قالَ: نعَم، وإن كنتَ على نَهْرٍ جارٍ\" .
 .❤️🌸┊𖤐𓈒𓏲
""",
    """ عن أبي هريره رضي الله عنه قال قال رسول الله صلى الله عليه وسلم (من سئل عن علم فكتمه الجم يوم القيامة بلجام من نار)أخرجه الترمذي 
.❤️🌸┊𖤐𓈒𓏲
""",
    """عن أبي موسى رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم (مثل ما بعثني الله به من الهدى والعلم كمثل غيث أصاب أرضا فكانت منها طائفة طيبه قبلت الماء فأنبتت الكلاء والعشب الكثير وكان منها أجادب أمسكت الماء فنفع الله بها الناس فشربوا منها وسقوا وزرعوا وأصاب طائفة منها أخرى إنما هي قيعان لا تمسك ماء ولا تنبت كلاء فذلك مثل من فقه في دين الله ونفعه ما بعثي الله به فعلم وعلم ومثل من لم يرفع بذلك رأسا ولم يقبل هدى الله الذي أرسلت به)أخرجه البخاري 
❤️🌸┊𖤐𓈒𓏲
""",
    """: عن معاوية رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم (من يرد الله به خيرا يفقه في الدين) أخرجه البخاري 
 ❤️🌸┊𖤐𓈒𓏲 .
""",
    """
 عن أبي هريره رضي الله عنه قال قال رسول الله صلى الله عليه وسلم (من سلك طريقا يلتمس فيه علما سهل الله له به طريقا إلى الجنة) أخرجه مسلم 

❤️🌸┊𖤐𓈒𓏲 .
""",
    """
قال رسول الله صلى الله عليه وسلم: مَن حَفِظَ عَشْرَ آياتٍ مِن أوَّلِ سُورَةِ الكَهْفِ عُصِمَ مِنَ الدَّجَّالِ.❤️🌸┊𖤐𓈒𓏲
""",
    """
‏{عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم إن لله تسعا وتسعين اسما، مائة إلا واحدا، إنه وتر يحب الوتر، من حفظها دخل الجنة، وهي: الله الواحد الأحد. الحديث. رواه ابن ماجه وأصله في الصحيحين.}.❤️🌸┊𖤐𓈒𓏲
""",
    """
قال رسول الله صلى الله عليه وسلم: لَعَنَ رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ المُتَشَبِّهِينَ مِنَ الرِّجَالِ بالنِّسَاءِ، والمُتَشَبِّهَاتِ مِنَ النِّسَاءِ بالرِّجَالِ.
  ❤️🌸┊𖤐𓈒𓏲 .
""",
    """
{ قال رسول الله صلى الله عليه وسلم: (من قرأ حرفًا من كتابِ اللهِ فله به حسنةٌ والحسنةُ بعشرِ أمثالِها، لا أقولُ ألم حرفٌ، ولكن ألفٌ حرفٌ، ولامٌ حرفٌ، وميمٌ حرفٌ).
 }❤️🌸┊𖤐𓈒𓏲
""",
    """
(قال رسول الله صلى الله عليه وسلم: مَن قَامَ لَيْلَةَ القَدْرِ إيمَانًا واحْتِسَابًا، غُفِرَ له ما تَقَدَّمَ مِن ذَنْبِهِ، ومَن صَامَ رَمَضَانَ إيمَانًا واحْتِسَابًا غُفِرَ له ما تَقَدَّمَ مِن ذَنْبِهِ.ٌ )❤️🌸┊𖤐𓈒𓏲
""",
]

#تمت كتابه الكود بواسطة المطور هانتر تغيير الحقوق يثبت انك مطور بطيخه
#اوامر الجلب 


@bot.on(admin_cmd(pattern="حديث"))
async def ics(zel):
    await zel.edit("**احسنت اخي الكريم تستاهل قبله😘**")
    await asyncio.sleep(2)
    tosh = random.choice(MALATH)
    return await zel.edit(f"{tosh}")
