import asyncio
import random

MALATH = [
    """
من الذكر بعد الفراغ من الوضوء

(أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله..)
""",
    """
من دعاء لبس الثوب

(الحمد لله الذي كساني هذا (الثوب) ورزقنيه من غير حول مني ولا قوة...)
 ٍ ")❤️🌸┊𖤐𓈒𓏲
""",
    """
‏من دعاء لبس الثوب الجديد

(اللهم لك الحمد أنت كسوتنيه، أسألك من خيره وخير ما صنع له، وأعوذ بك من شره وشر ما صنع له)

""",
    """
(من الدعاء لمن لبس ثوبا جديدا

(تبلي ويخلف الله تعالى)

َ.). ❤️🌸┊𖤐𓈒𓏲
""",
    """
‏من دعاء دخول الخلاء

([بسم الله] اللهم إني أعوذ بك من الخبث والخبائث)
.ْ﴾❤️🌸┊𖤐𓈒𓏲
""",
    """
{من الذكر عند دخول المنزل

(بسم الله ولجنا، وبسم الله خرجنا، وعلى الله ربنا توكلنا، ثم ليسلم على أهله)

 ) ❤️🌸┊𖤐𓈒𓏲 .
""",
    """
(من دعاء الجلسة بين السجدتين

١-(رب اغفر لي، رب اغفر لي)



٢-(اللهم اغفر لي، وارحمني، واهدني، واجبرني، وعافني، وارزقني، وارفعني)
ٌّ.)❤️🌸┊𖤐𓈒𓏲
""",
    """
﴿ قال رسول الله صلى الله عليه وسلم: لا حَسَدَ إلَّا في اثْنَتَيْنِ: رَجُلٌ عَلَّمَهُ اللَّهُ القُرْآنَ، فَهو يَتْلُوهُ آناءَ اللَّيْلِ، وآناءَ النَّهارِ، فَسَمِعَهُ جارٌ له، فقالَ: لَيْتَنِي أُوتِيتُ مِثْلَ ما أُوتِيَ فُلانٌ، فَعَمِلْتُ مِثْلَ ما يَعْمَلُ، ورَجُلٌ آتاهُ اللَّهُ مالًا فَهو يُهْلِكُهُ في الحَقِّ، فقالَ رَجُلٌ: لَيْتَنِي أُوتِيتُ مِثْلَ ما أُوتِيَ فُلانٌ، فَعَمِلْتُ مِثْلَ ما يَعْمَلُ.
  ﴾❤️🌸┊𖤐𓈒𓏲
""",
    """: من دعاء الهم والحزن

(اللهم إني عبدك، ابن عبدك، ابن أمتك، ناصيتي بيدك، ماض في حكمك، عدل في قضاؤك، أسألك بكل اسم هو لك، سميت به نفسك، أو أنزلته في كتابك، أو علمته أحدا من خلقك، أو استأثرت به في علم الغيب عندك، أن تجعل القرآن ربيع قلبي، ونور صدري، وجلاء حزني، وذهاب همي)

من دعاء الهم والحزن

(اللهم إني أعوذ بك من الهم والحزن، والعجز والكسل، والبخل والجبن، وضلع الدين وغلبة الرجال)

 .❤️🌸┊𖤐𓈒𓏲
""",
    """
 من الأذكار بعد السلام من الصلاة

(أستغفر الله (ثلاثا) اللهم أنت السلام، ومنك السلام، تباركت يا ذا الجلال والإكرام)
 ❤️🌸┊𖤐𓈒𓏲
""",
    """
{   عن أبي امامة رضي الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقول( فضل العالم على العابد كفضلي على أدناكم) ثم قال صلى الله عليه وسلم ( إن الله وملائكته وأهل السماوات والأرض حتى النملة في جحرها وحتى الحوت ليصلون على معلمي الناس الخير)أخرجه أبو داود الحديث الحادي عشر: عن ابن مسعود رضي الله عنه قال قال صلى الله عليه وسلم( لا حسد إلا في اثنتين رجل آتاه الله مالا فسلطه على هلكته في الحق ورجل آتاه الله الحكمة فهو يقضي بها ويعلمها) أخرجه البخاري 
} .❤️🌸┊𖤐𓈒𓏲
""",
    """
‏﴿   من دعاء الكرب

(لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السموات ورب الأرض ورب العرش الكريم)

من دعاء الكرب

(اللهم رحمتك أرجو، فلا تكلني إلى نفسي طرفة عين، وأصلح لي شأني كله، لا إله إلا أنت)

من دعاء الكرب

(لا إله إلا أنت سبحانك إني كنت من الظالمين)

من دعاء الكرب

(الله الله ربي لا أشرك به شيئا)

َ ﴾.❤️🌸┊𖤐𓈒𓏲
""",
    """
 من دعاء من خاف ظلم السلطان

(اللهم رب السموات السبع، ورب العرش العظيم، كن لي جارا من فلان بن فلان، وأحزابه من خلائقك، أن يفرط علي أحد منهم أو يطغى، عز جارك، وجل ثناؤك، ولا إله إلا أنت)

من دعاء من خاف ظلم السلطان

(الله أكبر، الله أعز من خلقه جميعا، الله أعز مما أخاف وأحذر، أعوذ بالله الذي لا إله إلا هو، الممسك السموات السبع أن يقعن على الأرض إلا بإذنه، من شر عبدك فلان، وجنوده وأتباعه وأشياعه، من الجن والإنس، اللهم كن لي جارا من شرهم، جل ثناؤك وعز جارك، وتبارك اسمك، ولا إله غيرك)

❤️🌸┊𖤐𓈒𓏲
""",
    """
من دعاء الوسوسة في الصلاة والقراءة

(أعوذ بالله من الشيطان الرجيم، واتفل على يسارك)
 .❤️🌸┊𖤐𓈒𓏲
""",
    """ من دعاء من استصعب عليه أمر

(اللهم لا سهل إلا ما جعلته سهلا، وأنت تجعل الحزن إذا شئت سهلا)
.❤️🌸┊𖤐𓈒𓏲
""",
    """من دعاء من أصابه وسوسة في الإيمان

(يستعيذ بالله)

من دعاء من أصابه وسوسة في الإيمان

(ينتهي عما وسوس فيه)

من دعاء من أصابه وسوسة في الإيمان

(يقول: (آمنت بالله ورسله)

من دعاء من أصابه وسوسة في الإيمان

(يقرأ قوله تعالى: ﴿هو الأول والآخر والظاهر والباطن وهو بكل شيء عليم﴾)
❤️🌸┊𖤐𓈒𓏲
""",
    """: من  أدعية الاستسقاء

(اللهم اسقنا غيثا مغيثا مريئا مريعا، نافعا غير ضار، عاجلا غير آجل)

من  أدعية الاستسقاء

(اللهم أغثنا، اللهم أغثنا، اللهم أغثنا)

من  أدعية الاستسقاء

(اللهم اسق عبادك، وبهائمك، وانشر رحمتك، وأحيي بلدك الميت)
 ❤️🌸┊𖤐𓈒𓏲 .
""",
    """
 عن أبي هريره رضي الله عنه قال قال رسول الله صلى الله عليه وسلم (من سلك طريقا يلتمس فيه علما سهل الله له به طريقا إلى الجنة) أخرجه مسلم 

❤️🌸┊𖤐𓈒𓏲 .
""",
    """
من دعاء دخول السوق

(لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، يحيي ويميت، وهو حي لا يموت، بيده الخير، وهو على كل شيء قدير)
❤️🌸┊𖤐𓈒𓏲
""",
    """
‏{من ما يقول المسلم إذا مدح المسلم

قال النبي صلى الله عليه وسلم: (إذا كان أحدكم مادحا صاحبه لا محالة فليقل: أحسب فلانا والله حسيبه، ولا أزكي على الله أحدا، أحسبه – إن كان يعلم ذاك – كذا وكذا)
.}.❤️🌸┊𖤐𓈒𓏲
""",
    """
من ما يقول المسلم إذا مدح المسلم

قال النبي صلى الله عليه وسلم: (إذا كان أحدكم مادحا صاحبه لا محالة فليقل: أحسب فلانا والله حسيبه، ولا أزكي على الله أحدا، أحسبه – إن كان يعلم ذاك – كذا وكذا)

  ❤️🌸┊𖤐𓈒𓏲 .
""",
    """
{ من دعاء التعجب والأمر السار

(سبحان الله!)

من دعاء التعجب والأمر السار

(الله أكبر!)
ٌ).
 }❤️🌸┊𖤐𓈒𓏲
""",
    """
(من الاستغفار والتوبة

قال رسول الله صلى الله عليه وسلم: (والله إني لأستغفر الله وأتوب إليه في اليوم أكثر من سبعين مرة)

من الاستغفار والتوبة

وقال صلى الله عليه وسلم: (يا أيها الناس توبوا إلى الله فإني أتوب في اليوم إليه مائة مرة)

من الاستغفار والتوبة

وقال صلى الله عليه وسلم: (من قال أستغفر الله العظيم الذي لا إله إلا هو الحي القيوم وأتوب إليه، غفر الله له وإن كان فر من الزحف)
ِ.ٌ )❤️🌸┊𖤐𓈒𓏲
""",
]

#تمت كتابه الكود بواسطة المطور هانتر تغيير الحقوق يثبت انك مطور بطيخه
#اوامر الجلب 


@bot.on(admin_cmd(pattern="ذكر"))
async def ics(zel):
    await zel.edit("**احسنت اخي الكريم تستاهل قبله😘**")
    await asyncio.sleep(2)
    tosh = random.choice(MALATH)
    return await zel.edit(f"{tosh}")
